[
    {
        "name": "30 Arm Circles",
        "warmUp": "Stand tall and extend your arms out to the sides. Make small circles with your arms, gradually increasing the size. Perform for 30 seconds to effectively warm up your shoulders and arms.",
        "timer": null
    },
    {
        "name": "15 High Knees",
        "warmUp": "Incorporate high knees into your warm-up routine to activate your legs. Focus on driving your knees up towards your chest while maintaining a brisk pace. Consider marching in place instead of jumping.",
        "timer": null
    },
    {
        "name": "10 Sumo Squats",
        "warmUp": "Loosen up your hips and legs by performing gentle hip circles and side lunges. This will help prepare your lower body for the sumo squat movement.",
        "timer": null
    },
    {
        "name": "Run for 2 Min",
        "warmUp": "Start with a light jog, gradually increasing your pace. This will help to gradually elevate your heart rate and warm up your entire body. Consider a brisk walk instead of running.",
        "timer": "2:00"
    },
    {
        "name": "10 Pelvic Tilts",
        "warmUp": "Engage your core with gentle torso twists and side bends to warm up your abdomen. This will help activate the muscles you'll use during pelvic tilts.",
        "timer": null
    },
    {
        "name": "10 Side-Lying Leg Lifts",
        "warmUp": "Warm up your hips with light stretches, such as seated forward bends and gentle hip flexor stretches. This exercise helps strengthen the hip muscles without straining the core.",
        "timer": null
    },
    {
        "name": "10 Seated Leg Extensions",
        "warmUp": "Sit on a chair with your back straight. Extend one leg out in front of you, keeping it straight, then lower it back down. Alternate legs to strengthen your quadriceps without straining your core.",
        "timer": null
    },
    {
        "name": "10 Wall Slides",
        "warmUp": "Stand with your back against a wall and slide your arms up and down while keeping your elbows and wrists in contact with the wall. This helps strengthen the upper body and improve posture.",
        "timer": null
    },
    {
        "name": "10 Glute Bridges",
        "warmUp": "Lie on your back with your knees bent and feet flat on the floor. Lift your hips towards the ceiling, squeezing your glutes at the top. This exercise strengthens the glutes and hamstrings without straining the core.",
        "timer": null
    },
    {
        "name": "Wild Card (roller's choice!)",
        "warmUp": "Choose any warm-up exercise that you enjoy, such as jumping jacks or dynamic stretches, to get your body ready and energized for the workout.",
        "timer": null
    },
    {
        "name": "Transverse Abdominal Breathing (TVA Breathing) + Core Connection",
        "warmUp": "Focus on big inhales to expand your belly and exhales to pull your core in. This helps activate the deep abdominal muscles.",
        "timer": "0:30"
    },
    {
        "name": "Lying Heel Tap + Leg Lift",
        "warmUp": "Slide one heel out while keeping the core engaged, then lift it back up. Alternate sides while maintaining a flat core.",
        "timer": "0:30"
    },
    {
        "name": "Lying Bent Knee Pulls",
        "warmUp": "Hug one knee to your chest while keeping the opposite leg on the ground or hovering. Focus on avoiding any low back popping off the mat.",
        "timer": "0:30"
    },
    {
        "name": "Elevated Bent Knee March",
        "warmUp": "In a bent knee position, alternate tapping your toes down while keeping your core tight and rib cage in.",
        "timer": "0:30"
    },
    {
        "name": "Elevated Leg Extension + Leg Drop",
        "warmUp": "Kick one leg out and lower it, then pull it back in. Keep the other knee close to your chest to control the intensity.",
        "timer": "0:30"
    },
    {
        "name": "Elevated Leg Extension + 2 Circles",
        "warmUp": "Kick the leg out and draw two circles with your toe. This engages the core and challenges stability.",
        "timer": "0:30"
    },
    {
        "name": "Elevated Bent Knee V-Taps",
        "warmUp": "Open and close your legs in a V shape while focusing on pulling the pelvic floor and inner thighs together.",
        "timer": "0:30"
    },
    {
        "name": "Elevated First Position Kick Outs",
        "warmUp": "Kick your legs out while keeping your heels together and toes pointed out. This helps engage the pelvic floor and core.",
        "timer": "0:30"
    }
]